function setup() {
  createCanvas(400, 600);
}

function draw() {
  background(135, 206, 235);

  // ====================
  // 왼쪽 위 아령
  // ====================
  fill(150);
  noStroke();
  rect(20, 35, 80, 10); // 손잡이

  fill(0);
  ellipse(20, 40, 30, 30);
  ellipse(100, 40, 30, 30);

  // ====================
  // 오른쪽 위 농구공
  // ====================
  fill(255, 165, 0);
  stroke(0);
  strokeWeight(2);
  ellipse(340, 50, 90, 90);

  // 가로줄
  line(295, 50, 385, 50);

  // 세로줄 3개
  line(340, 5, 340, 95);
  line(320, 9, 320, 91);
  line(360, 9, 360, 91);

  noStroke();

  // ====================
  // 목
  // ====================
  fill(230, 200, 170);
  rect(170, 340, 60, 60);

  // ====================
  // 어깨 (남색 옷)
  // ====================
  fill(0, 0, 139);

  beginShape();
  vertex(140, 370);

  bezierVertex(
    0, 380,
    0, 450,
    140, 450
  );

  vertex(260, 450);

  bezierVertex(
    400, 450,
    400, 380,
    260, 370
  );

  endShape(CLOSE);

  // ====================
  // 얼굴
  // ====================
  fill(255, 220, 190);
  ellipse(200, 250, 200, 230);

  // ====================
  // 머리
  // ====================
  fill(0);

  beginShape();
  vertex(100, 250);

  bezierVertex(
    200, 250,
    150, 160,
    200, 180
  );

  bezierVertex(
    250, 160,
    200, 250,
    300, 250
  );

  vertex(300, 150);
  vertex(200, 130);
  vertex(100, 150);

  endShape(CLOSE);

  // ====================
  // 눈
  // ====================
  fill(255);
  arc(160, 245, 50, 25, 0, PI);
  arc(240, 245, 50, 25, 0, PI);

  fill(0);

  beginShape();
  vertex(135, 245);
  vertex(185, 245);
  vertex(180, 238);
  vertex(140, 238);
  endShape(CLOSE);

  beginShape();
  vertex(215, 245);
  vertex(265, 245);
  vertex(260, 238);
  vertex(220, 238);
  endShape(CLOSE);

  arc(160, 245, 30, 18, 0, PI);
  arc(240, 245, 30, 18, 0, PI);

  // ====================
  // 눈썹
  // ====================
  beginShape();
  vertex(140, 230);
  vertex(180, 230);
  vertex(175, 220);
  vertex(145, 220);
  endShape(CLOSE);

  beginShape();
  vertex(220, 230);
  vertex(260, 230);
  vertex(255, 220);
  vertex(225, 220);
  endShape(CLOSE);

  // ====================
  // 코
  // ====================
  stroke(0);
  strokeWeight(2);

  line(200, 255, 200, 290);

  strokeWeight(1);
  line(195, 290, 205, 290);

  // ====================
  // 입
  // ====================
  strokeWeight(2);

  line(175, 325, 225, 325);

  line(175, 325, 172, 323);
  line(225, 325, 228, 323);

  // ====================
  // 귀
  // ====================
  noStroke();
  fill(255, 220, 190);

  ellipse(100, 250, 30, 65);
  ellipse(300, 250, 30, 65);
}
